app/views/awards_program_species/_form.html.erb

SELECT `awards_programs`.* FROM `awards_programs`
---
     <%= f.label :awards_program_id, "Program" %><br />
     <%=
       @program = AwardsProgram.all

SELECT `awards_program_categories`.* FROM `awards_program_categories`
---
    <%= f.label :awards_program_category_id, "Category" %><br />
    <%=
      @category = AwardsProgramCategory.all