app/views/notifications/_form.html.erb

    <%= f.label :notification_type_id %>:
    <%= f.collection_select(:notification_type_id, NotificationType.all, :id, :name) %>
---
SELECT `notification_types`.* FROM `notification_types`