app/views/executive_members/_form.html.erb

    <%= f.label :member_id %>
    <%=
      @members = Member.all
---
SELECT `members`.* FROM `members`

    <%= f.label :executive_position_id %>
    <%=
      @ep = ExecutivePosition.all
---
SELECT `executive_positions`.* FROM `executive_positions`