app/views/awards_program_classes/_form.html.erb

    <%= f.label :awards_program_id %> <br />
    <%=
      @awards_programs = AwardsProgram.all
---
SELECT `awards_programs`.* FROM `awards_programs`