app/views/awards_program_categories/_form.html.erb

    <%= f.label :awards_program_class_id, "Class" %><br />
    <%=
      @apc = AwardsProgramClass.all
---
SELECT `awards_program_classes`.* FROM `awards_program_classes`