app/views/dealers/_edit_form.html.erb

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `dealer_locations` WHERE (`dealer_locations`.dealer_id = 1)) AS subquery
SELECT `dealer_locations`.* FROM `dealer_locations` WHERE (`dealer_locations`.dealer_id = 1)
---
  </div>
  <% if @dealer.dealer_location.size > 0 %>