app/views/dealers/show.html.erb

SELECT `dealer_locations`.* FROM `dealer_locations` WHERE (`dealer_locations`.dealer_id = 1)
---
  </tr>
  <% @dealer.dealer_location.each do |dl| %>