app/controllers/awards_program_species_controller.rb

  def index
    @awards_program_species = AwardsProgramSpecies.all
---
SELECT `awards_program_species`.* FROM `awards_program_species`

  def edit
    @awards_program_species = AwardsProgramSpecies.find(params[:id])
---
SELECT `awards_program_species`.* FROM `awards_program_species` WHERE (`awards_program_species`.`id` = 2) LIMIT 1

  def create
    @awards_program_species = AwardsProgramSpecies.new(params[:awards_program_species])

    respond_to do |format|
      if @awards_program_species.save
---
INSERT INTO `awards_program_species` (`awards_program_category_id`, `created_at`, `name`, `updated_at`) VALUES (1, '2010-11-09 13:56:39', 'All species not listed elsewhere', '2010-11-09 13:56:39')

  def update
    @awards_program_species = AwardsProgramSpecies.find(params[:id])

    respond_to do |format|
      if @awards_program_species.update_attributes(params[:awards_program_species])
---
SELECT `awards_program_species`.* FROM `awards_program_species` WHERE (`awards_program_species`.`id` = 2) LIMIT 1
UPDATE `awards_program_species` SET `awards_program_category_id` = 1, `awards_program_id` = NULL, `updated_at` = '2010-11-09 19:54:33' WHERE (`awards_program_species`.`id` = 2)

  def destroy
    @awards_program_species = AwardsProgramSpecies.find(params[:id])
    @awards_program_species.destroy
---
SELECT `awards_program_species`.* FROM `awards_program_species` WHERE (`awards_program_species`.`id` = 1) LIMIT 1
DELETE FROM `awards_program_species` WHERE (`awards_program_species`.`id` = 1)