app/controllers/awards_program_classes_controller.rb

SELECT `awards_program_classes`.* FROM `awards_program_classes`
---
  def index
    @awards_program_classes = AwardsProgramClass.all

SELECT `awards_program_classes`.* FROM `awards_program_classes` WHERE (`awards_program_classes`.`id` = 1) LIMIT 1
---
  def edit
    @awards_program_class = AwardsProgramClass.find(params[:id])

INSERT INTO `awards_program_classes` (`awards_program_id`, `classification`, `created_at`, `points`, `updated_at`) VALUES (2, 'Class A', '2010-11-09 03:34:57', 5, '2010-11-09 03:34:57')
---
  def create
    @awards_program_class = AwardsProgramClass.new(params[:awards_program_class])

    respond_to do |format|
      if @awards_program_class.save

SELECT `awards_program_classes`.* FROM `awards_program_classes` WHERE (`awards_program_classes`.`id` = 1) LIMIT 1
UPDATE `awards_program_classes` SET `awards_program_id` = 1, `updated_at` = '2010-11-09 03:45:36' WHERE (`awards_program_classes`.`id` = 1)
---
  def update
    @awards_program_class = AwardsProgramClass.find(params[:id])

    respond_to do |format|
      if @awards_program_class.update_attributes(params[:awards_program_class])