app/controllers/awards_program_categories_controller.rb

  def index
    @awards_program_categories = AwardsProgramCategory.all
---
SELECT `awards_program_categories`.* FROM `awards_program_categories`

  def edit
    @awards_program_category = AwardsProgramCategory.find(params[:id])
---
SELECT `awards_program_categories`.* FROM `awards_program_categories` WHERE (`awards_program_categories`.`id` = 1) LIMIT 1

  def create
    @awards_program_category = AwardsProgramCategory.new(params[:awards_program_category])

    respond_to do |format|
      if @awards_program_category.save
---
INSERT INTO `awards_program_categories` (`awards_program_class_id`, `awards_program_id`, `created_at`, `name`, `updated_at`) VALUES (NULL, NULL, '2010-11-08 21:19:47', NULL, '2010-11-08 21:19:47')

  def update
    @awards_program_category = AwardsProgramCategory.find(params[:id])
---
SELECT `awards_program_categories`.* FROM `awards_program_categories` WHERE (`awards_program_categories`.`id` = 1) LIMIT 1