app/controllers/bap_controller.rb

  def form
    @member_bap = MemberBap.new
    @member_bap.member = User.find(session[:user_id]).member if session[:user_id]
---
SELECT `members`.* FROM `members` WHERE (`members`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def save_form
    @member_bap = MemberBap.new
    @member_bap.member = User.find(session[:user_id]).member if session[:user_id]
---
SELECT `members`.* FROM `members` WHERE (`members`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1