app/controllers/dealers_controller.rb

SELECT `dealers`.* FROM `dealers`
---
  def index
    @dealers = Dealer.all

SELECT `dealers`.* FROM `dealers` WHERE (`dealers`.`id` = 1) LIMIT 1
---
  def show
    @dealer = Dealer.find(params[:id])

SELECT `dealers`.* FROM `dealers` WHERE (`dealers`.`id` = 1) LIMIT 1
---
  def edit
    @dealer = Dealer.find(params[:id])

INSERT INTO `dealers` (`created_at`, `email`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `name`, `notes`, `updated_at`) VALUES ('2010-10-27 12:59:04', 'http://cichlaholic.com/', NULL, NULL, NULL, NULL, 'The aFISHionados', '*special discounts offered on \'Aquarium Society\' weekends and during other events', '2010-10-27 12:59:04')
---
  def create
    @dealer = Dealer.new(params[:dealer])

    respond_to do |format|
      if @dealer.save

SELECT `dealers`.* FROM `dealers` WHERE (`dealers`.`id` = 1) LIMIT 1
UPDATE `dealers` SET `image_content_type` = 'image/jpeg', `image_file_name` = 'aFISHionados_card.jpg', `image_file_size` = 23715, `image_updated_at` = '2010-11-06 13:51:48', `updated_at` = '2010-11-06 13:51:48' WHERE (`dealers`.`id` = 1)
---
  def update
    @dealer = Dealer.find(params[:id])

    if params[:commit] == 'Add Location'
      redirect_to(:controller => 'dealer_locations', :action => 'new', :id => params[:id], :referer => request.env["HTTP_REFERER"])
    else

    respond_to do |format|
      if @dealer.update_attributes(params[:dealer])

SELECT `dealers`.* FROM `dealers` WHERE (`dealers`.`id` = 5) LIMIT 1
DELETE FROM `dealers` WHERE (`dealers`.`id` = 5)
---
  def destroy
    @dealer = Dealer.find(params[:id])
    @dealer.destroy