app/controllers/dealer_locations_controller.rb

SELECT `dealer_locations`.* FROM `dealer_locations`
---
  def index
    @dealer_locations = DealerLocation.all

SELECT `dealer_locations`.* FROM `dealer_locations` WHERE (`dealer_locations`.`id` = 0) LIMIT 1
---
  def show
    @dealer_location = DealerLocation.find(params[:id])

SELECT `dealer_locations`.* FROM `dealer_locations` WHERE (`dealer_locations`.`id` = 1) LIMIT 1
---
  def edit
    @dealer_location = DealerLocation.find(params[:id])

INSERT INTO `dealer_locations` (`address`, `created_at`, `dealer_id`, `phone`, `updated_at`) VALUES ('test', '2010-10-27 13:34:28', 1, '', '2010-10-27 13:34:28')
SELECT `dealers`.* FROM `dealers` WHERE (`dealers`.`id` = 1) LIMIT 1
---
  def create
    @dealer_location = DealerLocation.new(params[:dealer_location])

    respond_to do |format|
      if @dealer_location.save
        dealer = Dealer.find(@dealer_location.dealer_id)

SELECT `dealer_locations`.* FROM `dealer_locations` WHERE (`dealer_locations`.`id` = 2) LIMIT 1
UPDATE `dealer_locations` SET `address` = '#3-825 Erin St', `updated_at` = '2010-10-28 17:15:00' WHERE (`dealer_locations`.`id` = 17)
SELECT `dealers`.* FROM `dealers` WHERE (`dealers`.`id` = 1) LIMIT 1
---
  def update
    @dealer_location = DealerLocation.find(params[:id])
    respond_to do |format|
      if @dealer_location.update_attributes(params[:dealer_location])
        dealer = Dealer.find(@dealer_location.dealer_id)

SELECT `dealer_locations`.* FROM `dealer_locations` WHERE (`dealer_locations`.`id` = 1) LIMIT 1
DELETE FROM `dealer_locations` WHERE (`dealer_locations`.`id` = 1)
---
  def destroy
    @dealer_location = DealerLocation.find(params[:id])
    dealer = @dealer_location.dealer_id
    @dealer_location.destroy