app/controllers/executive_positions_controller.rb

  def index
    @executive_positions = ExecutivePosition.all
---
SELECT `executive_positions`.* FROM `executive_positions`

  def show
    @executive_position = ExecutivePosition.find(params[:id])
---
SELECT `executive_positions`.* FROM `executive_positions` WHERE (`executive_positions`.`id` = 1) LIMIT 1

  def edit
    @executive_position = ExecutivePosition.find(params[:id])
---
SELECT `executive_positions`.* FROM `executive_positions` WHERE (`executive_positions`.`id` = 1) LIMIT 1

  def create
    @executive_position = ExecutivePosition.new(params[:executive_position])

    respond_to do |format|
      if @executive_position.save
---
INSERT INTO `executive_positions` (`created_at`, `email`, `position_name`, `updated_at`, `voting_position`) VALUES ('2010-10-20 21:44:55', '', 'No Position', '2010-10-20 21:44:55', 0)

  def update
    @executive_position = ExecutivePosition.find(params[:id])
---
SELECT `executive_positions`.* FROM `executive_positions` WHERE (`executive_positions`.`id` = 5) LIMIT 1