app/controllers/executive_members_controller.rb

SELECT `executive_members`.* FROM `executive_members`
---
  def index
    @executive_members = ExecutiveMember.all

SELECT `executive_members`.* FROM `executive_members` WHERE (`executive_members`.`id` = 1) LIMIT 1
---
  def show
    @executive_member = ExecutiveMember.find(params[:id])

SELECT `executive_members`.* FROM `executive_members` WHERE (`executive_members`.`id` = 1) LIMIT 1
---
  def edit
    @executive_member = ExecutiveMember.find(params[:id])

INSERT INTO `executive_members` (`created_at`, `executive_position_id`, `updated_at`, `user_id`) VALUES ('2010-10-20 14:05:22', NULL, '2010-10-20 14:05:22', NULL)
---
  def create
    @executive_member = ExecutiveMember.new(params[:executive_member])

    respond_to do |format|
      if @executive_member.save

SELECT `executive_members`.* FROM `executive_members` WHERE (`executive_members`.`id` = 1) LIMIT 1
---
  def update
    @executive_member = ExecutiveMember.find(params[:id])