app/controllers/home_controller.rb

SELECT `notifications`.* FROM `notifications` ORDER BY created_at desc
---
  def index
    @notifications = Notification.order("created_at desc")