app/controllers/librarybooks_controller.rb

  def index
    @librarybooks = Librarybook.search(params[:search]).all.paginate(:per_page => 20, :page => params[:page])
---
SELECT `librarybooks`.* FROM `librarybooks`

  def show
    @librarybook = Librarybook.find(params[:id])
---
SELECT `librarybooks`.* FROM `librarybooks` WHERE (`librarybooks`.`id` = 11) LIMIT 1

  def edit
    @librarybook = Librarybook.find(params[:id])
---
SELECT `librarybooks`.* FROM `librarybooks` WHERE (`librarybooks`.`id` = 43) LIMIT 1

  def update
    @librarybook = Librarybook.find(params[:id])

    respond_to do |format|
      if @librarybook.update_attributes(params[:librarybook])
---
SELECT `librarybooks`.* FROM `librarybooks` WHERE (`librarybooks`.`id` = 59) LIMIT 1
UPDATE `librarybooks` SET `image` = 'test', `updated_at` = '2010-10-20 21:51:36' WHERE (`librarybooks`.`id` = 59)