app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.order("meeting_date asc")
---
SELECT `meetings`.* FROM `meetings` WHERE (meeting_date >= '2010-10-26 13:45:36') ORDER BY meeting_date asc

  def show
    @meeting = Meeting.find(params[:id])
---
SELECT `meetings`.* FROM `meetings` WHERE (`meetings`.`id` = 1) LIMIT 1

  def edit
    @meeting = Meeting.find(params[:id])
---
SELECT `meetings`.* FROM `meetings` WHERE (`meetings`.`id` = 1) LIMIT 1

  def create
    @meeting = Meeting.new(params[:meeting])

    respond_to do |format|
      if @meeting.save
---
INSERT INTO `meetings` (`announcement`, `created_at`, `event`, `meeting_date`, `program`, `speaker`, `updated_at`) VALUES ('', '2010-10-25 20:11:00', 'General Meeting', '2010-11-21', 'Rainbowfish', 'Ken Boorman', '2010-10-25 20:11:00')

  def update
    @meeting = Meeting.find(params[:id])

    respond_to do |format|
      if @meeting.update_attributes(params[:meeting])
---
SELECT `meetings`.* FROM `meetings` WHERE (`meetings`.`id` = 2) LIMIT 1
UPDATE `meetings` SET `program` = '6:00pm, <a href=\"http://maps.google.ca/maps?f=q&hl=en&geocode=&q=roscoe%27s+grill+winnipeg+mb&sll=49.891235,-97.15369&sspn=44.124301,79.101563&ie=UTF8&z=13\">Roscoe\'s Grill</a><br />\r\n38-1313 Border Street<br />\r\nCost: $20/adult, $10/child <br />\r\nGrinch game: please bring a wrapped hobby (fish) related item ($10-$15 in value) if you want to participate ', `updated_at` = '2010-10-26 13:05:31' WHERE (`meetings`.`id` = 2)

  def destroy
    @meeting = Meeting.find(params[:id])
    @meeting.destroy
---
SELECT `meetings`.* FROM `meetings` WHERE (`meetings`.`id` = 3) LIMIT 1
DELETE FROM `meetings` WHERE (`meetings`.`id` = 3)