app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all
---
SELECT `newsletters`.* FROM `newsletters`

  def edit
    @newsletter = Newsletter.find(params[:id])
---
SELECT `newsletters`.* FROM `newsletters` WHERE (`newsletters`.`id` = 1) LIMIT 1

  def create
    @newsletter = Newsletter.new(params[:newsletter])

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO `newsletters` (`created_at`, `pdf_content_type`, `pdf_file_name`, `pdf_file_size`, `pdf_updated_at`, `title`, `updated_at`) VALUES ('2010-10-25 14:49:19', NULL, NULL, NULL, NULL, 'test', '2010-10-25 14:49:19')

  def update
    @newsletter = Newsletter.find(params[:id])

    respond_to do |format|
      if @newsletter.update_attributes(params[:newsletter])
---
SELECT `newsletters`.* FROM `newsletters` WHERE (`newsletters`.`id` = 2) LIMIT 1
UPDATE `newsletters` SET `pdf_file_name` = '2010_10.pdf', `pdf_file_size` = 1881991, `pdf_updated_at` = '2010-10-25 16:05:44', `title` = 'October 2010', `updated_at` = '2010-10-25 16:05:44' WHERE (`newsletters`.`id` = 2)

  def destroy
    @newsletter = Newsletter.find(params[:id])
    @newsletter.destroy
---
SELECT `newsletters`.* FROM `newsletters` WHERE (`newsletters`.`id` = 1) LIMIT 1
DELETE FROM `newsletters` WHERE (`newsletters`.`id` = 1)