app/controllers/notifications_controller.rb

  def index
   @notifications = Notification.all
---
SELECT `notifications`.* FROM `notifications`

  def show
   @notification = Notification.find(params[:id])
---
SELECT `notifications`.* FROM `notifications` WHERE (`notifications`.`id` = 1) LIMIT 1

  def edit
    @notification = Notification.find(params[:id])
---
SELECT `notifications`.* FROM `notifications` WHERE (`notifications`.`id` = 1) LIMIT 1

  def create
    @notification = Notification.new(params[:notification])
    @notification.user_id = session[:user_id]
    respond_to do |format|
      if @notification.save
---
INSERT INTO `notifications` (`created_at`, `message`, `notification_type_id`, `title`, `updated_at`, `user_id`) VALUES ('2010-10-26 15:26:35', '<b>This is a Test</b> I hope it works', 1, 'test', '2010-10-26 15:26:35', 2)

  def update
    @notification = Notification.find(params[:id])

    respond_to do |format|
      if @notification.update_attributes(params[:notification])
---
SELECT `notifications`.* FROM `notifications` WHERE (`notifications`.`id` = 1) LIMIT 1
UPDATE `notifications` SET `message` = 'Let me start off by thanking all who helped out during the September Giant auction. You have made the auction move along very smoothly.\r\n\r\nI would like to also thank Volker’s Aquarium, Chris Biggs and Ron Brereton for their donations to the club.\r\n\r\nOur next meeting, October 17th, we have Udo Rohmann (Ontario). Udo is the Exchange editor of the Durham Region Aquarium Society, and will be giving us a hands on demonstration on the Hamburg Mat Filter. The Hamburg Mat Filter (or Hamburg Mattenfilter) is very popular in Germany and is starting to catch on here as well. From fry and shrimp tanks to species tanks these are very effective filters.\r\n\r\nMoving on to November 21st, we have Ken Boorman (Ontario). Ken is the Past President of the Sarnia Aquarium Society, and now serves as the club Librarian (along with Lisa Boorman). He is also the Vice-President of CAOAC of which our club is a member. Ken will be speaking on the New Guinea Rainbowfish. Another talk you don’t want to miss.\r\n\r\nSteve Bansee\r\n~ASW President', `notification_type_id` = 2, `title` = 'President\'s Message - October', `updated_at` = '2010-10-26 18:41:47' WHERE (`notifications`.`id` = 1)

  def destroy
    @notification = Notification.find(params[:id])
    @notification.destroy
---
SELECT `notifications`.* FROM `notifications` WHERE (`notifications`.`id` = 2) LIMIT 1
DELETE FROM `notifications` WHERE (`notifications`.`id` = 2)