app/controllers/users_controller.rb

  def index
    #@users = User.find(:all, :order => :name)
    @users = User.joins(:member).order("name")
---
SELECT `users`.* FROM `users` INNER JOIN `members` ON `members`.`id` = `users`.`member_id` ORDER BY name

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`address`, `admin`, `created_at`, `email`, `executive_member`, `hashed_password`, `login_name`, `name`, `phone_number`, `postal_code`, `province_id`, `salt`, `updated_at`) VALUES ('', 0, '2010-11-05 18:40:47', '', 0, '75cbd82199127f272b5c8277a4ddcb1153aa2db3', 'test', 'test', '', '', '1', '21759391000.0255499469246064', '2010-11-05 18:40:47')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `address` = '', `administrator` = 0, `email` = '', `phone_number` = '', `postal_code` = '', `province_id` = '1', `updated_at` = '2010-11-05 18:47:51' WHERE (`users`.`id` = 1)