app/views/bap/_participant_info.html.erb

    <label for="province">Province:</label>
    <%=
      @province = Province.all
---
SELECT `provinces`.* FROM `provinces`