app/views/members/_form.html.erb

    <%= f.label :province_id %><%= mark_required(@member, :province_id) %><br />
    <%=
      @provinces = Province.all
---
SELECT `provinces`.* FROM `provinces`